Repository: zklinger/gtypist
Catalog: po/*.po
Languages: ro

source: internal error: strdup
ro: eroare internă: strdup

source: invalid key binding
ro: legătură tastă invalidă

source: invalid function key number
ro: număr tastă functională invalid

source: data exceeds screen length
ro: datele depășesc lungimea ecranului

source: instructions are limited to two lines
ro: instrucțiunile sunt limitate la două linii

source: internal error: fseek
ro: eroare internă: fseek

source: internal error: malloc
ro: eroare internă: malloc

source: '*' must immediately follow '%'
ro: '*' trebuie să urmeze imediat după '%'

source: missing '%'
ro: '%' lipsă

source: '%' must immediately follow value
ro: '%' trebuie să urmeze imediat după valoare

source: overflow in do_error_max_set
ro: depășire în do_error_max_set

source: Invalid value for "E:" (out of range)
ro: Valoare invalidă pentru "E:" (în afara domeniului)

source: label '%s' not found
ro: eticheta '%s' nu a fost găsită

source: unknown command
ro: comandă necunoscută

source: Try '%s --help' for more information.
ro: Încearcă '%s --help' pentru mai multe informații

source: %s: invalid curs-flash value
ro: %s: valoare curs-flash invalidă

source: %s: invalid colours value
ro: %s: valoare culori invalidă

source: %s: invalid banner-colours value
ro: %s: valoare banner-colours invalidă

source: Tutorial
ro: Ghid

source: Query
ro: Interogare

source: Drill
ro: Exercițiu

source: Speed test
ro: Test viteză

source: Press RETURN or SPACE to continue, ESC to return to the menu
ro: Apasă ENTER sau SPAȚIU pentru a continua, ESC pentru a te întoarce la meniu

source: Your error-rate is too high. You have to achieve %.1f%%.
ro: Rata de erori este prea mare. Trebuie să obții %.1f%%.

source: You failed this test, so you need to go back to %s.
ro: Ai eșuat acest test, deci trebuie să te întorci la %s.

source: Press R to repeat, N for next exercise or E to exit
ro: Apasă R pentru repetare, N pentru următorul exercițiu sau I pentru Ieșire

source: Press R to repeat or E to exit
ro: Apasă R pentru repetare sau I pentru ieșire

source: Are you sure you want to exit this lesson? [Y/N]
ro: Ești sigur că vrei să părăsești această lecție? [D/N]

source: Sorry, gtypist is configured to forbid skipping exercises.
ro: Scuze, gtypist este configurat să interzică sărirea peste exerciții.

source: Y/N
ro: D/N

source: R/N/E
ro: R/N/I

source: %s: %s environment variable not set
ro: %s: variabila de mediu %s not set

source: can't find or open file
ro: nu se popate găsi sau deschide fișierul

source: Loading the script...
ro: Se încarcă scriptul...

source: internal error: fopen
ro: eroare internă: fopen

source: Use arrowed keys to move around, SPACE or RETURN to select and ESCAPE to go back
ro: Folosește săgețile să te miști, SPAȚIU sau ENTER pentru a selecta și ESC pentru a te întoarce

source: line
ro: linie

source: label contains space
ro: eticheta conține spațiu

source: label redefinition
ro: redefinire etichetă

source: Invalid multibyte sequence (wrong encoding?)
ro: Secvență multioctet invalidă (codificare greșită?)

source: data shortage
ro: lipsă de date

source: missing ':'
ro: ':' lipsă

source: line too long for screen
ro: linie prea lungă pentru ecran

source: Happy Typing!
ro: Tastare Plăcută!

source: couldn't convert UTF-8 to wide characters
ro: nu s-a putut face conversia la gama largă de charactere UTF-8

source: error in setcchar()
ro: eroare în setchar()

source: error writing config file!
ro: eroare la scrierea fișirului de configurație

source: Welcome to GNU Typist! This message is meant to get you started using gtypist. Please read the manual (at http://www.gnu.org/software/gtypist/doc/, or type "info gtypist") for more in-depth information! Use the arrow keys or PGUP/PGDN to scroll this window, SPACE/ENTER to start using gtypist, or 'D' to use gtypist and never show this dialog again. There are two types of typing exercises: "drills" and "speed tests". In a "drill", gtypist displays text in every other line on the screen and waits for the user to correctly type the exact same text in the intermediate lines. In a "speed test", gtypist displays text on the screen and waits for the user to correctly type the exact same text over the top. In both exercise types, you have to repeat the test if your error percentage is higher than a maximum error percentage. The default is 3%, but if this is too difficult you can change it by running gtypist with the "-e <maxpct>" command-line option. On most X11-based terminal emulators you can use Ctrl--/Ctrl-+ to resize the terminal window. For Mac OS X, Command--/Command-+ serve this purpose. On Windows, change the properties of the terminal window by clicking on the top left corner of the window and choosing 'Properties'. Several typing courses are available from the main menu. As well as the "QWERTY" courses, lessons are also available for other keyboard layouts, such as Dvorak and Colemak, and numeric keypads. There are also other lessons, besides the ones available on the main menu (such as the new lesson for programmers). To see a list of the other lessons, select "More lessons..." from the main menu. To use one of these other lessons, run gtypist with the name of the lesson file (including .typ) as a command-line argument. See the comments at the top of each file for more information about the source and the au7thor of the lessons. If you want to write your own lessons, look at gtypist's manual, it's really simple! If you have any questions about GNU Typist, please write to the gtypist mailing list at <bug-gtypist@gnu.org>. Happy Typing!
ro: Bine ați venit la GNU Typist! Acest mesaj vă va ajuta să începeți. Pentru informații mai detaliate citiți manualul (la http://www.gnu.org/software/gtypist/doc/, sau tastați "info gtypist"). Foloșește săgețile sau PGUP/PGDN pentru a parcurge textul, SPAȚIU/ENTER pentru a începe, sau 'D' pentru a începe gtypist și pentru a dezactiva acest mesaj de acum încolo. Există două timpuri de lecții: "exerciții" si "teste de viteză". Într-un exercițiu, gtypist afișează text pe ecran lăsând linii intermediare libere pentru ca utilizator să tasteze corect același text. Într-un "test de viteză", se afișează text și se asteaptă ca utilizatorul să tasteze corect, exact același text peste cel afișat. În ambele tipuri de lecții, testele trebuie repetate dacă rate de eroare este mai mare decât rata maximă de eroare. Valoare prestabilită este 3%, dar dacă este prea dificil ea poate fi schimbată, rulând gtypist cu opțiunea "-e <maxpct>" În cele mai multe emulatore de terminale, bazate pe X11, folosește Ctrl--/ Ctrl++ pentru a schimba mărimea ferestrei terminalului. Pentru Mac OS X, Command--/Commnand-+ îndeplinesc aceași funcție. Pe Windows, pentru a schimba proprietățiile ferestrei dă click în stânga sus și alege 'Properties'. Multiple cursuri sunt accesibile din meniul principal. Odată cu lecțiile "QWERTY", sunt disponibile și lecții pentru alte configurații de tastaturi, cum ar fi Dvorak, Colemak și pentru tastaturi numerice. Sunt și lecții disponibile în afara meniului principal (cum ar fi noua lecție pentru programatori). Pentru a vedea o lista a acestora selectați "More lessons..." din meniul principal. Pentru a folosi una dintre aceste lecții, rulează gtypist cu numele lecției (incluzând .typ) ca argument. Vezi comentarile de la începutul fiecărui fișier .typ pentru mai multe informații despre sursa și autorul lecției. Dacă vreți să vă scrieți propriile lecții uitațivă peste manualul gtypist, este foarte ușor! Dacă aveți întrebări despre GNU Typist, vă rugăm să scrieți către lista de discuții <bug-gtypist@gnu.org>. Tastare Plăcută!

source: Welcome screen
ro: Ecran de întâmpinare

source: Press SPACE, ENTER or ESCAPE to start gtypist, or 'D' to disable this dialog
ro: Tastați SPAȚIU, ENTER sau ESC pentru a porni gtypist, sau 'D' pentru a dezactiva acest mesaj

source: Raw speed|= %6.2f wpm
ro: Viteză brută|= %6.2f wpm

source: Raw speed|= %7.2f cpm
ro: Viteză brută|= %7.2f cpm

source: Adjusted speed|= %6.2f wpm
ro: Viteză ajustată|= %6.2f wpm

source: Adjusted speed|= %7.2f cpm
ro: Viteză ajustată|= %7.2f cpm

source: |with %.1f%% errors
ro: |cu %.1f%% erori

source: Personal best|= %6.2f wpm
ro: Cel mai bun scor personal|= %6.2f wpm

source: Personal best|= %7.2f cpm
ro: Cel mai bun scor personal|= %7.2f cpm

source: |new personal best
ro: |nou cel mai bun scor personal
